// Задача 41
// Console.WriteLine("Введите количество чисел М в массиве: ");
// int M = Convert.ToInt32(Console.ReadLine());

// int[] array = new int[M];
// int index = 0;

// Console.WriteLine("А теперь введите числа массива в количестве М: ");
// while (index < M)
// {
//     array[index] = Convert.ToInt32(Console.ReadLine());
//     index++;
// }
// index = 0;
// int count = 0;

// while (index < M)
// {
//     if (array[index] > 0)
//         count++;
//     index++;
// }

// Console.WriteLine("Количество чисел массива больше 0: " + count);

// Задача 43

// Console.WriteLine("Введите числа k1, b1, k2, b2: ");
// double k1 = Convert.ToInt32(Console.ReadLine());
// double b1 = Convert.ToInt32(Console.ReadLine());
// double k2 = Convert.ToInt32(Console.ReadLine());
// double b2 = Convert.ToInt32(Console.ReadLine());

// double x = (b1 - b2)/(k2 - k1);
// double y = k2 * x + b2;

// Console.WriteLine("Координаты точки пересечения прямых: (" + x + "; " + y + ")");